label first_world:
  
    scene bg blckfon
    with fade
  
    "Ох..."
  
    "Моя голова..."
  
    "Так болит, опять то чувство..."
  
    "Тот же холод, как будто я в маразильнике"
  
    #нужно какой-та видео где открывается глаза Анны
    
    e "Где я?"
  
    e "Неужели..."
  
    x "Да думаю так"
  
    x "Ты попала в другой мир"
  
    x "Жаль конечно что этот не тот мир где я здесь"
  
    x "Но всё равно это какой-та прогресс"
  
    e "Согласна"
  
    e "Хорошо что этот мир не оказался таким опасным"
  
    x "Да, это меня немножко удивило"
  
    e "Значит во многих случаи мир будет лпасным"
  
    x "Да можно и так сказать"
  
    e "Понятно, ну что ж. Давай изучать этот мир"
  
    e "Может что-нибудь найдем"
  
    x "Нужно в первую очередь найти кого-то"
  
    x "А потом будем решать что делать"
  
    "Я начала ходит и изучать"
  
    #здесь нужно поставить музыку walk (right here we need put music walk)
  
    "Здесь очень красиво и уютно"
  
    #здест нужно ещё картинка

    "Уже час как я в новым мире"
  
    "И я не устала , потому что этот красота дает мне эенергию"
    
    "Но после еще какой-та времени я увидела большой дом"
  
    e "Ого какой большой дом"
  
    x "Дом?{w} Тогда пойдем тогда туда"
  
    e "Хорошо"
  
    "Я начала ходить прямо по трапинке где ведет к этому дому"
  
    "На удивлении там возле дома лежала какая-та девушка"
  
    "Примерно в моем возрасте"
  
    "Ох, я же не знаю сколько мне лет..."
  
    "Ну это я сравнила визуально"
  
    "Нужно поговорить с ней"
  
    e "Стоп"
  
    x "Что?"
  
    e "А как разговаривать-та?"
  
    e "Я имею ввиду тебя же только я слышу"
  
    e "Если они услышать что я разговариваю с тобой то они подумают что я сошла с ума"
  
    x "Ну это легко можно исправить"
  
    y "Стоп что?! Ты можешь разговаривать прямо в моем голове?"
  
    x "Ну да"
  
    e "Только не скажи что ты можешь читать мои мысли"
  
    x "К сожелению нет"
    
    y "Хорошо что так"

    y "А то я начала уже пугатся"

    x "Ну что пайдешь?"

    e "Да"

    e "Хей, привет"
 
    y "Она спит что-ли?"
    
    x "Вряд-ли, хотя возможно"
    
    y "Думаю я разбужу её, у нас нет другого варианта"
    
    e "Хе...."

    #begin dialouge between Anna and Asaka
    
    q "Не мешай мне думать"
    
    "Всё таки она не спит"
    
    e "Давай поговорим..."
    
    q "Я же сказал что не мешай думать!"
    
    x "Стоп так не пойдет"
    
    x "Если ты и дальше будешь так говорить мы точно не сможем что-то узнать о твоем прошлом"
    
    y "Тогда что делать-та?"
    
    x "Помнишь наш контракт?"
    
    y "Да помню"
    
    x "Ну так вот, если бы я не предложит контракт то мы бы стали так свободно общатся?"
    
    y "Думаю нет"
    
    x "Вот. Предложи ему тоже какой-та контракт или договор"
    
    x "Сейчас она думат а чем-та"
    
    x "Ее реакция потверждает что это ей важно"
    
    x "Так что предложи ему помочь об этом"
    
    x "Это может как-та помочь"
    
    y "Ладно хорошо"
    
    "Меня больше и больше пугает АО"
    
    "Он слишком умен"
    
    "Нужно быть осторожным"
    
    e "Хей, о чем ты думаешь"
    
    e "Может могу помочь как-та?"
    
    q "А ты умен?"
    
    e "Что? Умна-ли я?"
    
    e "Нуууу....."
    
    x "Скажи да"
    
    x "Мы должны узнать хоть бы какую-та деталь"
    
    e "Да,можно сказать так"

    #Asaka's first appearance

    show asaka talking at right2
    with dissolve 

    q "Точно?"
    
    e "Да, можешь положится на меня"
    
    q "Хорошо, тогда..."
    
    x "Предложи ей контракт"
    
    e "Стоп давай договоримся"
    
    q "О чем?"
    
    e "Мне нужно помощь"
 
    e "То есть найти кое-какую иформацию"
 
    e "Если я тебе помогу то ты тоже поможешь мне"
    
    e "Идет?"

    show asaka serious at right2
 
    "Я пока что не могу ей сказать про прошлое"
 
    "Всё таки нужно деражть в секрете"
 
    "По крайней мере я буду чуть больше в безопасности"

    show asaka talking at right2

    q  "Если это не какое-та зло то я не против"
 
    e "Нет это не зло, это связано мной так что..."
 
    q "Хорошо, доверюсь тебе но не думай что за тобой не буду следить"
 
    q "Хорошо, хорошо"
 
    "Какой странный характер..."
 
    e "Ну о чем думала?"
 
    q "Я надеюсь что ты никому не скажешь это"
 
    "Что-то серезное?"
 
    e "Обещаю"
 
    q "Ладно"
 
    q "2 дня назад умер мой отец..."
 
    "Умер отец?!Это думаю очень серезно..."
 
    q "Он был иследовательем, у него был интерес к разным сверхестественным существам"

    q "Он просто думал что есть такие существа"

    "Ну получается он правильно думал"

    q "Хотя в реальности это невозможно"

    show asaka serious at right2

    "Ты даже не представляешь что это возможно"

    "Ну я тоже как она сначало думала что такое не существует"

    "Ну зато теперь знаю"

    show asaka talking at right2

    q "У меня есть список кто может быть убийцей"

    q "И я думала о том кто может быть убийцей"

    q "Если ты поможешь мне найти убийцу то я тоже помогу тебе"

    "Ого вот этого я не ожидала"

    "Ну как-та не хочется"

    "Есть шанс что я сама тоже могу умереть"

    x "Отличная сделка"

    menu:

        ".....":

            jump first_world2

        "Знаешь почему-та мне хочется тебе врезать":

            jump first_world2

label first_world2:

    y "У тебя вообще работает голова?!"

    y "Она сказала убийца"

    y "Это значит что есть шанс что меня тоже могут убить!"

    x "Интересное предложение"

    x "Но ты думаешь у нас есть другой вариант?"

    x "Здесь есть хоть человек который мы нашли спустя 2-3 часа"

    x "Если мы откажемся шансы что найти другого человека очень маленькие"

    x "Не волнуйся, у меня хороший интеллект"

    x "Я помогу тебе найти убийцу"

    y "Вот блин, и как теперь откажешь..."

    e "Хорошо, я согласна"

    e "Я помогу тебе и потом ты поможешь мне"

    show asaka normal at right2

    q "Ладно тогда идемте ко мне"

    #right here we need to put background street  DON'T FORGET!!!

    "Мы начали идти к ..."

    "Стоп я же даже не знаю её имя"

    e "Кстати тебя как зовут?"

    q "Ах, да прости мне что я не приставился"

    r "Меня зовут Асака"

    r "Рада знакомству"

    e "Меня зовут Анна"

    e "Я тоже рада знакомству Асака"

    x "Ого Асака...Интересное имя"

    y "Ты знаешь о нем что нибудь?"

    x "Нет не знаю просто интересное имя"

    y "Понятно"

    q "Вот и мой дом"

    #right here we need to put house's picture

    screen bg house
    with fade

    "Ого , вот это местечко"

    "Сразу жутко становится"

    "Даже от взгляда"

    "Ну чтож ладно"

    "Надеюсь мы быстро найдем убийцу"

    










    

    



    

    


