label first_world:
  
    scene bg blckfon
    with fade
  
    "Ох..."
  
    "Моя голова..."
  
    "Так болит, опять то чувство..."
  
    "Тот же холод, как будто я в маразильнике"
  
    #нужно какой-та видео где открывается глаза Анны
    
    e "Где я?"
  
    e "Неужели..."
  
    x "Да думаю так"
  
    x "Ты попала в другой мир"
  
    x "Жаль конечно что этот не тот мир где я здесь"
  
    x "Но всё равно это какой-та прогресс"
  
    e "Согласна"
  
    e "Хорошо что этот мир не оказался таким опасным"
  
    x "Да, это меня немножко удивило"
  
    e "Значит во многих случаи мир будет лпасным"
  
    x "Да можно и так сказать"
  
    e "Понятно, ну что ж. Давай изучать этот мир"
  
    e "Может что-нибудь найдем"
  
    x "Нужно в первую очередь найти кого-то"
  
    x "А потом будем решать что делать"
  
    "Я начала ходит и изучать"
  
    #здесь нужно поставить музыку walk (right here we need put music walk)
  
    "Здесь очень красиво и уютно"
  
    #здест нужно ещё картинка

    "Уже час как я в новым мире"
  
    "И я не устала , потому что этот красота дает мне эенергию"
    
    "Но после еще какой-та времени я увидела большой дом"
  
    e "Ого какой большой дом"
  
    x "Дом?{w} Тогда пойдем тогда туда"
  
    e "Хорошо"
  
    "Я начала ходить прямо по трапинке где ведет к этому дому"
  
    "На удивлении там возле дома лежала какая-та девушка"
  
    "Примерно в моем возрасте"
  
    "Ох, я же не знаю сколько мне лет..."
  
    "Ну это я сравнила визуально"
  
    "Нужно поговорить с ней"
  
    e "Стоп"
  
    x "Что?"
  
    e "А как разговаривать-та?"
  
    e "Я имею ввиду тебя же только я слышу"
  
    e "Если они услышать что я разговариваю с тобой то они подумают что я сошла с ума"
  
    x "Ну это легко можно исправить"
  
    "Стоп что?! Ты можешь разговаривать прямо в моем голове?"
  
    x "Ну да"
  
    e "Только не скажи что ты можешь читать мои мысли"
  
    x "К сожелению нет"
    
    y "Хорошо что так"

    y "А то я начала уже пугатся"

    x "Ну что пайдешь?"

    e "Да"

    



    

    


